---
kind: method
id: M:Autodesk.Revit.DB.ConnectionValidationInfo.Dispose
source: html/8b07c736-56e5-1bb0-db16-f81439d44c6a.htm
---
# Autodesk.Revit.DB.ConnectionValidationInfo.Dispose Method

Releases all resources used by the ConnectionValidationInfo

## Syntax (C#)
```csharp
public void Dispose()
```